#### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [1]:
!pip install pandas

Requirement already satisfied: pandas in d:\dc_dds_07\venv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in d:\dc_dds_07\venv\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\dc_dds_07\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\dc_dds_07\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in d:\dc_dds_07\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in d:\dc_dds_07\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [3]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

data=[1,2,3,4,5]

series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## Create a Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

data_1 = {"Name": "Amit","Class":2018}
series_2 = pd.Series(data_1)
print(series_2)

a    1
b    2
c    3
dtype: int64
Name     Amit
Class    2018
dtype: object

In [5]:
data=[10,20,30]
index=['i','ii','iii']
pd.Series(data,index=index)

i      10
ii     20
iii    30
dtype: int64

In [6]:
## Dataframe
## create a Dataframe from a dictionary of list

data={
    'Name':['Abhishek','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)

print(type(df))

df

<class 'pandas.core.frame.DataFrame'>

       Name  Age       City
0  Abhishek   25  Bangalore
1      John   30   New York
2      Jack   45    Florida

In [31]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Abhishek','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)

print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

       Name  Age       City
0  Abhishek   32  Bangalore
1      John   34  Bangalore
2     Bappy   32  Bangalore
3      JAck   32  Bangalore

In [8]:
df=pd.read_csv('sales_data.csv')
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [10]:
pip install openpyxl

Collecting openpyxl
  Using cached openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Requirement already satisfied: et-xmlfile in d:\dc_dds_07\venv\lib\site-packages (from openpyxl) (2.0.0)
Using cached openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Installing collected packages: openpyxl
Successfully installed openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

In [11]:
df_1 = pd.read_excel("sales_data.xlsx")

df_1

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [12]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    240 non-null    int64
 1   Date              240 non-null    object
 2   Product Category  240 non-null    object
 3   Product Name      240 non-null    object
 4   Units Sold        240 non-null    int64
 5   Unit Price        240 non-null    float64
 6   Total Revenue     240 non-null    float64
 7   Region            240 non-null    object
 8   Payment Method    240 non-null    object
dtypes: float64(2), int64(2), object(5)
memory usage: 17.0+ KB

In [14]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [15]:
### Accessing Data From Dataframe
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [17]:
# df['Name']  # uncomment to get a KeyError
df['Product Name']

0                                        iPhone 14 Pro
1                                     Dyson V11 Vacuum
2                                     Levi's 501 Jeans
3                                    The Da Vinci Code
4                              Neutrogena Skincare Set
                            ...
235    Nespresso Vertuo Next Coffee and Espresso Maker
236                          Nike Air Force 1 Sneakers
237             The Handmaid's Tale by Margaret Atwood
238               Sunday Riley Luna Sleeping Night Oil
239                         Yeti Rambler 20 oz Tumbler
Name: Product Name, Length: 240, dtype: object

In [18]:
data = pd.DataFrame({'Brand': ['Maruti', 'Hyundai', 'Tata',
                               'Mahindra', 'Maruti', 'Hyundai',
                               'Renault', 'Tata', 'Maruti'],
                     'Year': [2012, 2014, 2011, 2015, 2012,
                              2016, 2014, 2018, 2019],
                     'Kms Driven': [50000, 30000, 60000,
                                    25000, 10000, 46000,
                                    31000, 15000, 12000],
                     'City': ['Gurgaon', 'Delhi', 'Mumbai',
                              'Delhi', 'Mumbai', 'Delhi',
                              'Mumbai', 'Chennai',  'Ghaziabad'],
                     'Mileage':  [28, 27, 25, 26, 28,
                                  29, 24, 21, 24]})

# displaying the DataFrame
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [19]:
display(data.loc[(data.Brand == 'Maruti') & (data.Mileage > 25)])

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

In [20]:
display(data.iloc[[0, 2, 4, 7]])

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
2    Tata  2011       60000   Mumbai       25
4  Maruti  2012       10000   Mumbai       28
7    Tata  2018       15000  Chennai       21

In [21]:
df.loc[0]

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [22]:
df.iloc[0]

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [23]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [26]:
## Accessing a specified element
df.at[2,'Region']

'Asia'

In [27]:
df.at[2,'Product Name']

"Levi's 501 Jeans"

In [29]:
## Accessing a specified element using iat
df.iat[3,2]

'Books'

In [30]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [32]:
### Data MAnipulation with Dataframe
df

       Name  Age       City
0  Abhishek   32  Bangalore
1      John   34  Bangalore
2     Bappy   32  Bangalore
3      JAck   32  Bangalore

In [33]:
## Adding a column
df['Salary']=[50000,60000,70000,75000]
df

       Name  Age       City  Salary
0  Abhishek   32  Bangalore   50000
1      John   34  Bangalore   60000
2     Bappy   32  Bangalore   70000
3      JAck   32  Bangalore   75000

In [34]:
df.at[2,'Name']

'Bappy'

In [35]:
df.iat[3,2]

'Bangalore'

In [36]:
df

       Name  Age       City  Salary
0  Abhishek   32  Bangalore   50000
1      John   34  Bangalore   60000
2     Bappy   32  Bangalore   70000
3      JAck   32  Bangalore   75000

In [39]:
## Remove a column
df.drop('Salary',axis=1, inplace=True)

In [40]:
df

       Name  Age       City
0  Abhishek   32  Bangalore
1      John   34  Bangalore
2     Bappy   32  Bangalore
3      JAck   32  Bangalore

In [43]:
# df['Name']

In [42]:
## Add age to the column
df['Age']=df['Age']+1
df

       Name  Age       City
0  Abhishek   33  Bangalore
1      John   35  Bangalore
2     Bappy   33  Bangalore
3      JAck   33  Bangalore

In [44]:
df.drop(0,inplace=True)

In [45]:
df

    Name  Age       City
1   John   35  Bangalore
2  Bappy   33  Bangalore
3   JAck   33  Bangalore

In [46]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [47]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [48]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [49]:
print(df.dtypes)

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [54]:


# C:\Users\ADMIN\Downloads

df = pd.read_excel("C:/Users/ADMIN/Downloads/data_science_job_roles.xlsx")

df

,Category,Role,Key Focus / Description,Core Skills & Tools,Typical Level
0,Strategic,Data Strategist,Aligns data initiatives with business goals an...,"Business strategy, communication, analytics pl...",Senior
1,Strategic,Data Product Manager,Oversees lifecycle of data products; ensures b...,"Product management, analytics, stakeholder man...",Senior
2,Strategic,Process Expert / Scrum Master,"Facilitates Agile, ensures smooth team collabo...","Agile, Scrum, facilitation, communication",Mid–Senior
3,Strategic,Project Manager (Data Science),"Manages data projects, timelines, scope, budge...","Project management, Agile, Jira, leadership",Mid–Senior
4,Strategic,Team / Data Science Manager,"Oversees data science teams, resource allocati...","Leadership, data strategy, stakeholder engagement",Senior
5,Architecture,Data Architect,"Designs enterprise data structures, database s...","SQL, database design, cloud data architecture",Senior
6,Engineering,Data Engineer,"Builds, maintains, and optimizes pipelines and...","Python, SQL, ETL tools, Spark, Airflow, AWS/GCP",Mid–Senior
7,Engineering,Big Data Engineer,Manages distributed systems for large-scale da...,"Java/Scala, Hadoop, Hive, big data optimization",Senior
8,Engineering,Cloud Data Engineer,Designs cloud-based data infrastructures for s...,"AWS Glue, Azure Data Factory, BigQuery, Snowflake",Mid–Senior
9,Engineering,MLOps Engineer,"Automates ML deployment, CI/CD for ML, monitor...","MLflow, Docker, Kubernetes, TensorFlow, APIs",Mid–Senior
10,Engineering,Deep Learning Engineer,"Develops neural networks, computer vision, and...","PyTorch, TensorFlow, GPUs, CNNs, RNNs",Senior
11,Analytics,Data Analyst,"Collects, preprocesses, explores, and visualiz...","SQL, Excel, Python/R, Tableau, Power BI",Entry–Mid
12,Analytics,Business Intelligence Analyst,"Designs dashboards, reports; focuses on busine...","Power BI, Tableau, SQL, data modeling",Mid
13,Analytics,Statistician / Data Researcher,"Applies statistical modeling, hypothesis testi...","R, Python, SAS, SPSS, statistics",Mid
14,Analytics,Quantitative Analyst (Quant),"Builds mathematical models for risk, pricing, ...","R, MATLAB, financial modeling, stochastic proc...",Senior
15,Science,Data Scientist,"Builds predictive models, performs advanced an...","Python, R, ML, statistics, data wrangling",Mid–Senior
16,Science,Machine Learning Engineer,Implements and deploys machine learning models...,"Python, TensorFlow, scikit-learn, APIs, DevOps",Mid–Senior
17,Science,Research Scientist (AI/ML),Creates novel ML algorithms and deep learning ...,"Python/C++, mathematics, model experimentation",Senior
18,Science,Applied Scientist,Bridges ML research and practical implementati...,"Applied AI, deployment, systems engineering",Senior
19,Governance,Data Quality Engineer,"Ensures data integrity, accuracy, and complian...","ETL tools, data testing, metadata management",Mid
20,Visualization,Data Visualization Specialist,Designs visual stories and dashboards for anal...,"Tableau, Power BI, D3.js, storytelling",Mid
21,Business,Decision Scientist / Data Strategist,Combines analytics with business acumen to dri...,"Power BI, SQL, business thinking",Senior
22,Product,Product Owner (for Data Teams),Defines and prioritizes backlog items aligned ...,"Agile frameworks, requirements management",Mid
23,Support,Process Coach / Agile Coach,"Trains data science teams in Agile, Scrum, and...","Coaching, facilitation, Agile frameworks",Senior
24,Support,Data Governance Specialist,"Manages compliance, privacy, and data access p...","GDPR, GRC tools, data cataloging",Senior